/******************************************************************************
    版权所有：优特电力科技股份有限公司
    版 本 号: 1.0
    文 件 名: store.c
    生成日期: 2016.10.12
    作    者：李科
    功能说明：数据存储
    其他说明：
    修改记录：
*******************************************************************************/
#include <stdio.h>
#include <string.h>

#include "w25q64.h"



/******************************************************************************
    功能说明：校验
    输入参数：
    输出参数：
    返 回 值：
*******************************************************************************/
unsigned short crc16(char *buf, int len)
{  
    int i;
    unsigned short crc = 0;
    
    for (i = 0; i < len; i++)
    {
        crc += buf[i];
    }
    
    return crc; 
}



/******************************************************************************
    功能说明：
    输入参数：
    输出参数：
    返 回 值：
*******************************************************************************/
int storage_write(unsigned long addr, char *data, int size)
{
    
    SPI_Flash_Write((unsigned char*)data, addr,(u16)size);
      
    return 0;
}


/******************************************************************************
    功能说明：
    输入参数：
    输出参数：
    返 回 值：
*******************************************************************************/
int storage_read(unsigned long addr, char *data, int size)
{
    SPI_Flash_Read((unsigned char*)data, addr, (u16)size);
    
    return size;
}