/******************************************************************************
      版权所有：依福斯电子
      版 本 号: 1.0
      文 件 名: task_master.c
      生成日期: 2016.09.26
      作    者：like
      功能说明：主站维护任务模块
      其他说明： 
      修改记录：
*******************************************************************************/
#include <FreeRTOS.h>
#include <task.h>
#include <timers.h>

#include "store_file.h"




/******************************************************************************
    功能说明：无
    输入参数：无
    输出参数：无
    返 回 值：无
*******************************************************************************/
void task_master(void *pvParameters)
{   
    for( ;; )
	{                   
        
        
        vTaskDelay(1000);
	}       
}

