/******************************************************************************
      版权所有：
      版 本 号: 1.0
      文 件 名: 
      生成日期: 2016.09.26
      作    者：like
      功能说明：升级任务模块
      其他说明： 
      修改记录：
*******************************************************************************/
#include <FreeRTOS.h>
#include <task.h>
#include <timers.h>

#include "ymodem.h"


/******************************************************************************
    功能说明：无
    输入参数：无
    输出参数：无
    返 回 值：无
*******************************************************************************/
void task_upgrade(void *pvParameters)
{
    char file_name[16] = {0};
     
    while(1)
    {
        ymodem_receive_file(file_name, YMODEM_PORT_COM);
        vTaskDelay(1000); 
    }        
}


